app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY "products".title ASC
---
  def index
    @products = Product.order(:title)